/*file name: Task3.cpp
*студент: Гурнік Вадим Миколайович
*група: КН – 1 - 4
*дата створення: 04/10/2022
*дата останньої зміни: 05/10/2022
*лабораторна робота №1
*тема: Алгоритмізація та програмування задач лінійної структури
*завдання: Розробити програму мовою С\С++ для відображення заданого
зображення відповідно варіанту індивідуального завдання, що наведено у таблиці
Г.3 з додатку Г. Для різних елементів зображення використати різні кольори.
Зображення має бути в стилі японського кросворду. Розмір зображення не менше
10 на 10 символів.
*/
#include <iostream>
#include<Windows.h>

using namespace std;

int main()
{
	HANDLE hConsole = GetStdHandle(STD_OUTPUT_HANDLE);
	SetConsoleTextAttribute(hConsole, 14);

	cout << "           ____" << endl;
	cout << "         / |   |\\" << endl;
	cout << "  _____/ \033[1;34m@\033[93m |   | \\" << endl;
	cout << " |\033[1;95m>\033[93m  . .   |   |  \\" << endl;
	cout << "  \\   .    \033[1;90m|||||\033[93m   \\__________________________" << endl;
	cout << "   \033[1;90m|||||||\033[93m\\     \033[1;31m__\033[93m      \033[1;37m_____\033[93m       \033[1;92m/   \\\033[93m     |\\" << endl;
	cout << "            \\  \033[1;31m|  |\033[93m    \033[1;37m/     | \033[93m     \033[1;92m|   |\033[93m     | \\" << endl;
	cout << "             \\  \033[1;31m\\/\033[93m    \033[1;37m|__    |\033[93m      \033[1;92m|__/\033[93m      |  \\" << endl;
	cout << "               \\         \033[1;37m\\__/\033[93m                /    \\" << endl;
	cout << "                |   ____________------\\     |      \\" << endl;
	cout << "                |  | |                ||    /       \\ " << endl;
	cout << "                |  | |                ||  |          \\" << endl;
	cout << "                |  | |                ||  |           \\" << endl;
	cout << "                |  | |                ||  |" << endl;
	cout << "               (__/_/                ((__/" << endl;
	return 0;
}